URLShortener/app/models/shortened_url.rb

  def self.random_code
    begin
      url = SecureRandom::urlsafe_base64
      raise if ShortenedUrl.exists?(short_url: url)
---
SELECT  1 AS one FROM "shortened_urls" WHERE "shortened_urls"."short_url" = $1 LIMIT $2  [["short_url", "00-Znkwk7GdGfwTK58bLzA"], ["LIMIT", 1]]

  def self.create!(user, long_url)
---
INSERT INTO "shortened_urls" ("long_url", "short_url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["long_url", "instagram.com"], ["short_url", "00-Znkwk7GdGfwTK58bLzA"], ["user_id", 1], ["created_at", "2019-01-24 01:02:27.161760"], ["updated_at", "2019-01-24 01:02:27.161760"]]